## Staging: eks
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`


**⚠️ &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
waf.tf
```




```terraform
Plan: 1 to add, 1 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_wafv2_regex_pattern_set.re_document_download will be created
  + resource "aws_wafv2_regex_pattern_set" "re_document_download" {
      + arn         = (known after apply)
      + description = "Regex matching valid document download endpoints"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "re_document_download"
      + scope       = "REGIONAL"
      + tags        = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all    = {
          + "CostCenter" = "notification-canada-ca-staging"
        }

      + regular_expression {
          + regex_string = "/_status"
        }
      + regular_expression {
          + regex_string = "/services/[\\w]{8}-[\\w]{4}-[\\w]{4}-[\\w]{4}-[\\w]{12}/documents"
        }
      + regular_expression {
          + regex_string = "/services/[\\w]{8}-[\\w]{4}-[\\w]{4}-[\\w]{4}-[\\w]{12}/documents/[\\w]{8}-[\\w]{4}-[\\w]{4}-[\\w]{4}-[\\w]{12}"
        }
    }

  # aws_wafv2_web_acl.notification-canada-ca will be updated in-place
  ~ resource "aws_wafv2_web_acl" "notification-canada-ca" {
        id         = "d7f2eabc-ee4e-4c8d-b262-97f5370b5555"
        name       = "notification-canada-ca-waf"
        tags       = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (5 unchanged attributes hidden)


      + rule {
          + name     = "document_download_invalid_path"
          + priority = 10

          + action {

              + block {
                  + custom_response {
                      + response_code = 204
                    }
                }
            }

          + statement {

              + not_statement {
                  + statement {

                      + regex_pattern_set_reference_statement {
                          + arn = (known after apply)

                          + field_to_match {

                              + uri_path {}
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "COMPRESS_WHITE_SPACE"
                            }
                          + text_transformation {
                              + priority = 2
                              + type     = "LOWERCASE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "document_download_api_invalid_path"
              + sampled_requests_enabled   = true
            }
        }

        # (7 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>